# shared - development
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/infrastructure/workspaces/development relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/development-shared/runs/run-fWkkW2PFYCxSbKdS

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.cluster.cockroach_cluster.default: Refreshing state... [id=f4a92f67-1e6d-4d9f-a9e9-bf10f475a452]
module.cluster.aws_ssm_parameter.default: Refreshing state... [id=development-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.aws_ssm_parameter.default must be replaced
-/+ resource "aws_ssm_parameter" "default" {
      ~ arn            = "arn:aws:ssm:ap-southeast-1:514472330244:parameter/development-cluster-id" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "development-cluster-id" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "development-cluster-id" -> "development-cockroachdb-serverless-cluster-id" # forces replacement
        tags           = {
            "environment"   = "development"
            "resource"      = "shared"
            "resource_type" = "serverless-cluster"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 2 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*